# ==============================
# Trading Mode
# ==============================

# PAPER  - симуляция сделки
# LIVE   - реальные ордера

TRADING_MODE = "PAPER"



# ==============================
# Exchange
# ==============================

EXCHANGE = "BINANCE"



# ==============================
# Market Type
# ==============================

# spot
# futures

MARKET_TYPE = "spot"



# ==============================
# Futures Settings
# ==============================

# уровень кредитного плеча для фьючерсов

LEVERAGE = 1



# ==============================
# Live Protection
# ==============================

# включить реальные ордера

ENABLE_LIVE_ORDERS = False